In [2]:
# 예제 : emp, dept 테이블 전체 조회하기

"""
SQL > select * from emp;
      select * from dept;
"""

import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp)
print('------------------------------')
dept=pd.read_csv("c:\\data\\dept3.csv")
print(dept)

    index  empno   ename        job     mgr         hiredate   sal    comm  \
0       1   7839    KING  PRESIDENT     NaN  1981-11-17 0:00  5000     NaN
1       2   7698   BLAKE    MANAGER  7839.0  1981-05-01 0:00  2850     NaN
2       3   7782   CLARK    MANAGER  7839.0  1981-05-09 0:00  2450     NaN
3       4   7566   JONES    MANAGER  7839.0  1981-04-01 0:00  2975     NaN
4       5   7654  MARTIN   SALESMAN  7698.0  1981-09-10 0:00  1250  1400.0
5       6   7499   ALLEN   SALESMAN  7698.0  1981-02-11 0:00  1600   300.0
6       7   7844  TURNER   SALESMAN  7698.0  1981-08-21 0:00  1500     0.0
7       8   7900   JAMES      CLERK  7698.0  1981-12-11 0:00   950     NaN
8       9   7521    WARD   SALESMAN  7698.0  1981-02-23 0:00  1250   500.0
9      10   7902    FORD    ANALYST  7566.0  1981-12-11 0:00  3000     NaN
10     11   7369   SMITH      CLERK  7902.0  1980-12-09 0:00   800     NaN
11     12   7788   SCOTT    ANALYST  7566.0  1982-12-22 0:00  3000     NaN
12     13   7876   ADAMS      CLERK  7788.0  1983-01-15 0:00  1100     NaN
13     14   7934  MILLER      CLERK  7782.0  1982-01-11 0:00  1300     NaN

    deptno
0       10
1       30
2       10
3       20
4       30
5       30
6       30
7       30
8       30
9       20
10      20
11      20
12      20
13      10
------------------------------
   deptno       dname       loc
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

In [3]:
# 예제 : DALLAS의 부서번호와 부서명을 출력하기

"""
SQL > select deptno, dname 
        from dept
        where loc='DALLAS';
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
dept=pd.read_csv("c:\\data\\dept3.csv")
print(dept[['deptno','dname']][dept['loc']=='DALLAS'])

   deptno     dname
1      20  RESEARCH

In [6]:
# Pandas를 활용한 조인


# 예제 : 이름과 부서 위치를 출력하기

"""
SQL > select e.ename, d.loc
        from emp e, dept d
        where e.deptno=d.deptno;
"""

import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
dept=pd.read_csv("c:\\data\\dept3.csv")
result=pd.merge(emp,dept, on='deptno')
print(result[['ename','loc']])

"""
* emp 데이터 프레임과 dept 데이터 프레임을 merge를 써서 조인시키는데

on='deptno'를 이용해서 연결고리가 되는 컬럼을 지정해주면 된다.

그리고 그 조인해 만든 데이터 프레임에서 ename과 loc만 조회했다.

조건을 안 줘보고 result 그대로 출력만 해보면 이해하기 쉽다.
"""
print('---------------------------------------')
print(result)

     ename       loc
0     KING  NEW YORK
1    CLARK  NEW YORK
2   MILLER  NEW YORK
3    BLAKE   CHICAGO
4   MARTIN   CHICAGO
5    ALLEN   CHICAGO
6   TURNER   CHICAGO
7    JAMES   CHICAGO
8     WARD   CHICAGO
9    JONES    DALLAS
10    FORD    DALLAS
11   SMITH    DALLAS
12   SCOTT    DALLAS
13   ADAMS    DALLAS
---------------------------------------
    index  empno   ename        job     mgr         hiredate   sal    comm  \
0       1   7839    KING  PRESIDENT     NaN  1981-11-17 0:00  5000     NaN
1       3   7782   CLARK    MANAGER  7839.0  1981-05-09 0:00  2450     NaN
2      14   7934  MILLER      CLERK  7782.0  1982-01-11 0:00  1300     NaN
3       2   7698   BLAKE    MANAGER  7839.0  1981-05-01 0:00  2850     NaN
4       5   7654  MARTIN   SALESMAN  7698.0  1981-09-10 0:00  1250  1400.0
5       6   7499   ALLEN   SALESMAN  7698.0  1981-02-11 0:00  1600   300.0
6       7   7844  TURNER   SALESMAN  7698.0  1981-08-21 0:00  1500     0.0
7       8   7900   JAMES      CLERK  7698.0  1981-12-11 0:00   950     NaN
8       9   7521    WARD   SALESMAN  7698.0  1981-02-23 0:00  1250   500.0
9       4   7566   JONES    MANAGER  7839.0  1981-04-01 0:00  2975     NaN
10     10   7902    FORD    ANALYST  7566.0  1981-12-11 0:00  3000     NaN
11     11   7369   SMITH      CLERK  7902.0  1980-12-09 0:00   800     NaN
12     12   7788   SCOTT    ANALYST  7566.0  1982-12-22 0:00  3000     NaN
13     13   7876   ADAMS      CLERK  7788.0  1983-01-15 0:00  1100     NaN

    deptno       dname       loc
0       10  ACCOUNTING  NEW YORK
1       10  ACCOUNTING  NEW YORK
2       10  ACCOUNTING  NEW YORK
3       30       SALES   CHICAGO
4       30       SALES   CHICAGO
5       30       SALES   CHICAGO
6       30       SALES   CHICAGO
7       30       SALES   CHICAGO
8       30       SALES   CHICAGO
9       20    RESEARCH    DALLAS
10      20    RESEARCH    DALLAS
11      20    RESEARCH    DALLAS
12      20    RESEARCH    DALLAS
13      20    RESEARCH    DALLAS

In [8]:
# 예제 : DALLAS에서 근무하는 사원들의 이름과 부서위치를 출력하기

"""
SQL > select e.ename, d.loc
        from emp e, dept d
        where d.loc='DALLAS';
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
dept=pd.read_csv("c:\\data\\dept3.csv")
result=pd.merge(emp,dept, on='deptno')
print(result[['ename','loc']][result['loc']=='DALLAS'])

    ename     loc
9   JONES  DALLAS
10   FORD  DALLAS
11  SMITH  DALLAS
12  SCOTT  DALLAS
13  ADAMS  DALLAS

In [9]:
# 예제 : 월급이 3000 이상인 사원들의 이름과 월급과 부서 위치를 출력하기

"""
SQL > select e.ename, e.sal, d.loc
        from emp e, dept d
        where e.sal>=3000;
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
dept=pd.read_csv("c:\\data\\dept3.csv")
result=pd.merge(emp,dept, on='deptno')
print(result[['ename','sal','loc']][result['sal']>=3000])

    ename   sal       loc
0    KING  5000  NEW YORK
10   FORD  3000    DALLAS
12  SCOTT  3000    DALLAS

In [10]:
# 예제 : 부서번호가 10번, 20번인 사원들의 이름과 부서위치와 부서번호를 출력하기
"""
SQL > select e.ename, d.loc, d.deptno
        from emp e, dept d
        where d.deptno in (10,20);
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
dept=pd.read_csv("c:\\data\\dept3.csv")
result=pd.merge(emp,dept, on='deptno')
print(result[['ename','loc','deptno']][result['deptno'].isin([10,20])])

"""
데이터 프레임에서는 in (10,20) 하면 오류가 나고, 반드시 isin을 사용한 뒤
( 괄호를 열고, [ 리스트 안에 조건들을 기입해야한다. ] )
"""

     ename       loc  deptno
0     KING  NEW YORK      10
1    CLARK  NEW YORK      10
2   MILLER  NEW YORK      10
9    JONES    DALLAS      20
10    FORD    DALLAS      20
11   SMITH    DALLAS      20
12   SCOTT    DALLAS      20
13   ADAMS    DALLAS      20

In [11]:
# 예제 : 월급이 1000에서 3000 사이인 사원들의 이름과 월급과 부서위치를 출력하기

"""
SQL > select e.ename, e.sal, d.loc
        from emp e, dept d
        where e.sal between 1000 and 3000;
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
dept=pd.read_csv("c:\\data\\dept3.csv")
result=pd.merge(emp,dept, on='deptno')
print(result[['ename','sal','loc']][result['sal'].between(1000,3000)])  # .between(a,b) 해주면 된다.

     ename   sal       loc
1    CLARK  2450  NEW YORK
2   MILLER  1300  NEW YORK
3    BLAKE  2850   CHICAGO
4   MARTIN  1250   CHICAGO
5    ALLEN  1600   CHICAGO
6   TURNER  1500   CHICAGO
8     WARD  1250   CHICAGO
9    JONES  2975    DALLAS
10    FORD  3000    DALLAS
12   SCOTT  3000    DALLAS
13   ADAMS  1100    DALLAS

In [13]:
# Pandas로 아우터 조인


# 예제 : 사원의 이름과, 부서 위치를 출력하는데, 특정 위치에 일치하는 사원이 없더라도 위치도 전부 출력하기 
"""
SQL > select e.ename, d.loc
        from emp e, dept d
        where e.deptno(+)=d.deptno;
        
SQL에서는 조인할 때 정보가 모자란 쪽에 (+) 해주는 것이 국룰이다.
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
dept=pd.read_csv("c:\\data\\dept3.csv")
result=pd.merge(emp,dept, on='deptno')
print(result[['ename','loc']]) # 일반 조인 --> 13개

print('--------------------------------------')

result=pd.merge(emp,dept, on='deptno',how='right')
print(result[['ename','loc']]) # 아우터 조인 --> 14개

"""
반대쪽으로 왼쪽으로 아우터 조인할 때는 right 대신 left를,

양쪽으로 아우터 조인하고 싶다면 outer를 입력해주면 된다.
"""

     ename       loc
0     KING  NEW YORK
1    CLARK  NEW YORK
2   MILLER  NEW YORK
3    BLAKE   CHICAGO
4   MARTIN   CHICAGO
5    ALLEN   CHICAGO
6   TURNER   CHICAGO
7    JAMES   CHICAGO
8     WARD   CHICAGO
9    JONES    DALLAS
10    FORD    DALLAS
11   SMITH    DALLAS
12   SCOTT    DALLAS
13   ADAMS    DALLAS
--------------------------------------
     ename       loc
0     KING  NEW YORK
1    CLARK  NEW YORK
2   MILLER  NEW YORK
3    JONES    DALLAS
4     FORD    DALLAS
5    SMITH    DALLAS
6    SCOTT    DALLAS
7    ADAMS    DALLAS
8    BLAKE   CHICAGO
9   MARTIN   CHICAGO
10   ALLEN   CHICAGO
11  TURNER   CHICAGO
12   JAMES   CHICAGO
13    WARD   CHICAGO
14     NaN    BOSTON

In [14]:
# Pandas로 서브쿼리 구현


# 예제 : JONES보다 월급이 더 많은 사원의 이름과 월급 출력하기
"""
SQL > select ename, sal
        from emp
        where sal > ( select sal
                        from emp
                        where ename='JONES');
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
j_sal=emp['sal'][emp['ename']=='JONES'].values[0]
print(emp[['ename','sal']][emp['sal']>j_sal])

"""
                        **중요**

조건에 들어갈 변수를 만들 때 항상 .values[0]을 하도록 하자.

저게 없으면 j_sal은 int 값이 아닌 데이터 프레임 형태가 되기 때문에

이후 조건 절에 들어가면 오류가 발생한다.
"""

    ename   sal
0    KING  5000
9    FORD  3000
11  SCOTT  3000

In [15]:
# 예제 : SCOTT과 같은 직업인 사원들의 이름과 월급 출력하기

"""
SQL > select ename, sal
        from emp
        where job = ( select job
                        from emp
                        where ename='SCOTT');
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
job=emp['job'][emp['ename']=='SCOTT'].values[0]
print(emp[['ename','sal']][emp['job']==job])

    ename   sal
9    FORD  3000
11  SCOTT  3000

In [16]:
# 예제 : 방금의 예제에서 SCOTT은 제외하고 출력하기

"""
SQL > select ename, sal
        from emp
        where job = ( select job
                        from emp
                        where ename='SCOTT') and ename!='SCOTT';
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
job=emp['job'][emp['ename']=='SCOTT'].values[0]
print(emp[['ename','sal']][(emp['job']==job) & (emp['ename']!='SCOTT')]) # 연산자 & 사용

  ename   sal
9  FORD  3000